In [35]:
import pandas as pd

In [36]:
file_to_load = "mortgage_long.csv"
mortgage_df = pd.read_csv(file_to_load)
mortgage_df.head()

      month  month_number  year  mortgage_rate    date
0   January             1  1992           8.01  199201
1  February             2  1992           8.38  199202
2     March             3  1992           8.58  199203
3     April             4  1992           8.47  199204
4       May             5  1992           8.29  199205

In [37]:
mortgage_df.dtypes

month             object
month_number       int64
year               int64
mortgage_rate    float64
date               int64
dtype: object

In [38]:
mortgage_df.isnull().sum()

month            0
month_number     0
year             0
mortgage_rate    5
date             0
dtype: int64

In [40]:
mortgage_df["date"] = pd.to_datetime(mortgage_df['date'],format='%Y%m')

In [41]:
mortgage_df.head()

      month  month_number  year  mortgage_rate       date
0   January             1  1992           8.01 1992-01-01
1  February             2  1992           8.38 1992-02-01
2     March             3  1992           8.58 1992-03-01
3     April             4  1992           8.47 1992-04-01
4       May             5  1992           8.29 1992-05-01

In [42]:
mortgage_df = mortgage_df.dropna()

In [43]:
# Create the output file (CSV) for the yoy_df.
output_data_file = "cleaned_mortage.csv"
# Export the City_Data into a CSV.
mortgage_df.to_csv(output_data_file, index=False)

In [28]:
values = {'dates':  [210305,210316,210328],
          'status': ['Opened','Opened','Closed']
          }

df = pd.DataFrame(values, columns = ['dates','status'])

df['dates'] = pd.to_datetime(df['dates'], format='%y%m%d')

df

       dates  status
0 2021-03-05  Opened
1 2021-03-16  Opened
2 2021-03-28  Closed